src/cf/InformationRegisters/GDS_ОбработкаВДокументообороте.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>GDS_ОбработкаВДокументообороте</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.GDS_РезультатыВыполненияТочкиМаршрутаОбработкиДО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатРемонтныйЛист</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.GDS_ТочкиМаршрутаСогласования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторТочкиМаршрута</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/GDS_ОбработкаВДокументообороте/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура Записать(ДанныеЗаписи) Экспорт
	
	Запись = СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, ДанныеЗаписи);
	Запись.ДатаОбновления = ТекущаяДатаСеанса();
	Запись.Записать(Истина);
	
КонецПроцедуры

Функция Текущая(Объект) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Объект", Объект);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	GDS_ОбработкаВДокументообороте.Объект КАК Объект,
	|	GDS_ОбработкаВДокументообороте.ТочкаМаршрута КАК ТочкаМаршрута,
	|	GDS_ОбработкаВДокументообороте.Дата КАК Дата,
	|	GDS_ОбработкаВДокументообороте.Выполнено КАК Выполнено,
	|	GDS_ОбработкаВДокументообороте.Комментарий КАК Комментарий,
	|	GDS_ОбработкаВДокументообороте.Исполнитель КАК Исполнитель,
	|	GDS_ОбработкаВДокументообороте.Результат КАК Результат,
	|	GDS_ОбработкаВДокументообороте.Отправлено КАК Отправлено,
	|	GDS_ОбработкаВДокументообороте.Порядок КАК Порядок
	|ИЗ
	|	РегистрСведений.GDS_ОбработкаВДокументообороте КАК GDS_ОбработкаВДокументообороте
	|ГДЕ
	|	GDS_ОбработкаВДокументообороте.Объект = &Объект";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура Очистить(Объект) Экспорт
	
	Записи = СоздатьНаборЗаписей();
	Записи.Отбор.Объект.Установить(Объект);
	Записи.Прочитать();
	Записи.Очистить();
	Записи.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
